<template>
    <div class="centered flex-1 flex flex-col">
        <div class="flex-1 flex flex-col gap-10 lg:flex-row lg:items-center lg:gap-20 xl:gap-32">
            <div class="relative h-[inherit] flex flex-col lg:w-1/3 lg:flex-none pb-10">
                <h2 class="block-title mb-10 lg:mb-20">ИСТОРИЯ</h2>
                <div class="space-y-6 text-[13px] leading-[1.3]">
                    <p>
                        В 1907 году в Петербурге была построена первая железобетонная мель-
                        ница. Ее хозяином был зажиточный купец второй гильдии — Д.И.
                        Мордух. Он загорелся идеей создать уникальный на то время мукомоль-
                        ный комбинат, благодаря которому весь город будет обеспечен свежими
                        хлебобулочными изделиями из муки высшего сорта.
                    </p>
                    <p>
                        Место для мукомольного комбината выбрано не случайно. Набережная
                        Обводного канала была определена удобством водных путей. Уже через
                        несколько месяцев работы “Невская мельница” стала одним из главных
                        продовольственных зданий в городе и снабжала пекарни мукой.
                    </p>
                    <p>
                        По всему Петербургу стали выстраиваться длинные очереди. Люди сбе-
                        гались на запах свежего румяного хлеба и готовы были стоять на морозе,
                        чтобы принести его к столу.
                    </p>
                    <p>
                        С тех пор прошло много лет, но именно эта мельница
                        стала символов праздника и традиций вкуса.
                    </p>
                </div> 
                <div class="bg-accent h-[2px] w-1/2 absolute bottom-0 left-0"></div>
            </div>
            <div class="lg:flex-1 lg:min-w-0">
                <img class="w-full" :src="`${routerPath}img/history-pic.png`" alt="">
            </div>
        </div>
    </div>
</template>

<script lang="ts" setup>
import { routerPath } from '@/routes';
</script>